Revit 2027 API
ShapeImporter.IsServiceAvailable Method
 Checks whether the data conversion service and Material Library are available.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsServiceAvailable()
Public Shared Function IsServiceAvailable As Boolean
public:
static bool IsServiceAvailable()
static member IsServiceAvailable : unit -> bool
Return Value
Boolean
 True if the data conversion service and Material Library are available, false otherwise.
Remarks
 ShapeImporter relies on optional data conversion functionality. This function checks whether it is available.
See Also
Reference
ShapeImporter Class
Autodesk.Revit.DB Namespace